org/The_geometry_of_physics_by_Theodore_Frankel_in_2012.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: The_geometry_of_physics_by_Theodore_Frankel_in_2012
#+TITLE: The geometry of physics by Theodore Frankel in 2012
* [[file:differential_geometry.org][differential geometry]], [[file:physics.org][physics]], [[file:mathematics.org][mathematics]], [[file:theoretical_physics.org][theoretical physics]]
* 0. Overview: An informal overview of Cartan's exterior differential forms, illustrated with an application to Cauchy's stress tensor
** Introduction
*** 0.a Introduction
** Vectors, 1-forms, and tensors
*** 0.b Two kinds of vectors
**** $$ \mathbf{v} = \mathbf{\partial} v$$
***** $$\mathbf{\partial} = \left( \mathbf{\partial}_1 , \ldots , \mathbf{\partial}_n \right)$$
***** $$v = \left(  v^1 \, \cdots \; v^n  \right)^T$$
**** 
*** 0.c Superscripts, subscripts, summation convention
*** 0.d Riemmanian metrics [[file:progress_indicators.org][progress indicators]]
*** 0.e Tensors
** Integrals and exterior forms
*** 0.f Line integrals
*** 0.g Exterior 2-forms
*** 0.h Exterior p-forms and algebra in $$\mathbb{R}^n$$
*** 0.i The exterior differential $$d$$
*** 0.j The push-forward of a vector and the pull-back of a form
*** 0.k Surface integrals and "Stokes' Theorem"
*** 0.l Electromagnetism, or, Is it a vector or a form?
*** 0.m Interior products
*** 0.n Volume forms and Cartan's vector valued exterior forms
*** 0.o Magnetic field for current in a straight wire
** Electricity and stresses
*** 0.p Cauchy stress, floating bodies, twisted cylinders, and strain energy
*** 0.q Sketch of Cauchy's "First theorem"
*** 0.r Sketch of Cauchy's "Second theorem" moments as generators of rotations
*** 0.s A remarkable formula for differentiating Line, Surface, and ..., Integrals
* I. Manifolds, tensors, and exterior forms
** 1. Manifolds and vector fields
*** 1.1 Submanifolds of Euclidean space
**** 1.1a Submanifolds of $$\mathbb{R}^N$$
**** 1.1b The geometry of Jacobian matrices: The "Differential"
**** 1.1c The main theorem on submanifolds of $$\mathbb{R}^N$$
**** 1.1d A nontrivial example: the configuration space of a rigid body
*** 1.2 Manifolds
**** a. Some notions from point set topology
**** b. The idea of a manifold
**** c. A rigorous definition of a manifold
**** d. Complex manifolds: the Riemann sphere
*** 1.3 Tangent vectors and mappings
**** a. Tangent or contravariant vectors
**** b. Vectors as differential operators
**** c. The tangent space to M^n at a point
**** d. Mappings and submanifolds of manifolds
**** e. Change of coordinates
*** 1.4 Vector fields and flows
**** a. Vector fields and flows on $$\mathbb{R}^n$$
**** b. Vector fields on manifolds
**** c. Straightening flows
** 2. Tensors and exterior forms
*** 2.1 Covectors and Riemannian metrics
*** 2.2 The tangent bundle
*** 2.3 The cotangent bundle and phase space
*** 2.4 Tensors
*** 2.5 The Grassmann or exterior algebra 
*** 2.6 Exterior differentiation
*** 2.7 Pull-backs
*** 2.8 Orientation and pseudoforms
*** 2.9 Interior products and vector analysis
*** 2.10 Dictionary
** 3. Integration of differential forms
*** 3.1 Integration over a parametrized subset
*** 3.2 Integration over manifolds with boundary
*** 3.3 Stokes's theorem
*** 3.4 Integration of pseudoforms
*** 3.5 Maxwell's equations
** 4. The Lie derivative
*** 4.1 The Lie derivative of a vector field
*** 4.2 The Lie derivative of a form
*** 4.3 Differentiation of integrals
*** 4.4 A problem set on Hamiltonian mechanics
** 5. The Poincare lemma and potentials
*** 5.1 A more general Stokes's theorem
*** 5.2 Closed forms and exact forms
*** 5.3 Complex analysis
*** 5.4 The converse to the Poincare lemma
*** 5.5 Finding potentials
** 6. Holonomic and nonholonomic constraints
*** 6.1 The Frobenius integrability condition
*** 6.2 Integrability and constraints
*** 6.3 Heuristic thermodynamics via Caratheodory
* II. Geometry and topology
** 7. $$\mathbb{R}^3$$ and Minkowski space
*** 7.1 Curvature and special relativity
**** a. Curvature of a space curve in $$\mathbb{R}^3$$
**** b. Minkowski space and special relativity
**** c. Hamiltonian formulation
*** 7.2 Electromagnetism in Minkowski space
**** a. Minkowski's electromagnetic field tensor
**** b. Maxwell's equations
** 8. The geometry of surfaces in $$\mathbb{R}^3$$
*** 8.1 The first and second fundamental forms
**** a. The first fundamental form, or metric tensor
**** b. The second fundamental form
*** 8.2 Gaussian and mean curvatures
**** a. Symmetry and self-adjointness
**** b. Principal normal curvatures
**** c. Gauss and mean curvatures: the Gauss normal map
*** 8.3 The Brouwer degree of a map: a problem set
**** a. The Brouwer degree
**** b. Complex analytic (Holomorphic) maps
**** c. The Gauss normal map revisited: the Gauss-Bonnet theorem
**** d. The Kronecker Index of a vector field
**** e. The Gauss looping integral
*** 8.4 Area, mean curvature, and soap bubbles
**** a. The first variation of area
**** b. Soap bubbles and minimal surfaces
*** 8.5 Gauss's theorema egregium
**** a. The equations of Gauss and Codazzi
**** b. The Theorema Egregium
*** 8.6 Geodesics
**** a. The first variation of arc length
**** b. The intrinsic derivative and the geodesic equation
*** 8.7 The parallel displacement of Levi-Civita
** 9. Covariant differentiation and curvature
*** 9.1 Covariant differentiation
**** a. Covariant derivative
**** b. Curvature of an affine connection
**** c. Torsion and symmetry
*** 9.2 The Riemmannian connection
*** 9.3 Cartan's exterior covariant differential
**** a. Vector-valued forms
**** b. The Covariant differential of a vector field
**** c. Cartan's structural equations
**** d. The exterior covariant differential of a vector-valued form
**** e. The curvature 2-forms
*** 9.4 Change of basis and gauge transformations
**** a. Symmetric connections only
**** b. Change of frame
*** 9.5 The curvature forms in a Riemannian manifold
**** a. The Riemmannian connection
**** b. Riemannian surfaces $$M^2$$
