content/posts/The_geometry_of_physics_by_Theodore_Frankel_in_2012.md
+++
title = "The geometry of physics by Theodore Frankel in 2012"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:13-04:00
slug = "The_geometry_of_physics_by_Theodore_Frankel_in_2012"
draft = false
+++

## [differential geometry]({{< relref "differential_geometry" >}}), [physics]({{< relref "physics" >}}), [mathematics]({{< relref "mathematics" >}}), [theoretical physics]({{< relref "theoretical_physics" >}}) {#differential-geometry--differential-geometry-dot-md--physics--physics-dot-md--mathematics--mathematics-dot-md--theoretical-physics--theoretical-physics-dot-md}


## 0. Overview: An informal overview of Cartan's exterior differential forms, illustrated with an application to Cauchy's stress tensor {#0-dot-overview-an-informal-overview-of-cartan-s-exterior-differential-forms-illustrated-with-an-application-to-cauchy-s-stress-tensor}


### Introduction {#introduction}

<!--list-separator-->

-  0.a Introduction


### Vectors, 1-forms, and tensors {#vectors-1-forms-and-tensors}

<!--list-separator-->

-  0.b Two kinds of vectors

    <!--list-separator-->

    -  \\[ \mathbf{v} = \mathbf{\partial} v\\]

        <!--list-separator-->

        -  \\[\mathbf{\partial} = \left( \mathbf{\partial}\_1 , \ldots , \mathbf{\partial}\_n \right)\\]

        <!--list-separator-->

        -  \\[v = \left(  v^1 \, \cdots \; v^n  \right)^T\\]

    <!--list-separator-->

    -

<!--list-separator-->

-  0.c Superscripts, subscripts, summation convention

<!--list-separator-->

-  0.d Riemmanian metrics [progress indicators]({{< relref "progress_indicators" >}})

<!--list-separator-->

-  0.e Tensors


### Integrals and exterior forms {#integrals-and-exterior-forms}

<!--list-separator-->

-  0.f Line integrals

<!--list-separator-->

-  0.g Exterior 2-forms

<!--list-separator-->

-  0.h Exterior p-forms and algebra in \\[\mathbb{R}^n\\]

<!--list-separator-->

-  0.i The exterior differential \\[d\\]

<!--list-separator-->

-  0.j The push-forward of a vector and the pull-back of a form

<!--list-separator-->

-  0.k Surface integrals and "Stokes' Theorem"

<!--list-separator-->

-  0.l Electromagnetism, or, Is it a vector or a form?

<!--list-separator-->

-  0.m Interior products

<!--list-separator-->

-  0.n Volume forms and Cartan's vector valued exterior forms

<!--list-separator-->

-  0.o Magnetic field for current in a straight wire


### Electricity and stresses {#electricity-and-stresses}

<!--list-separator-->

-  0.p Cauchy stress, floating bodies, twisted cylinders, and strain energy

<!--list-separator-->

-  0.q Sketch of Cauchy's "First theorem"

<!--list-separator-->

-  0.r Sketch of Cauchy's "Second theorem" moments as generators of rotations

<!--list-separator-->

-  0.s A remarkable formula for differentiating Line, Surface, and ..., Integrals


## I. Manifolds, tensors, and exterior forms {#i-dot-manifolds-tensors-and-exterior-forms}


### 1. Manifolds and vector fields {#1-dot-manifolds-and-vector-fields}

<!--list-separator-->

-  1.1 Submanifolds of Euclidean space

    <!--list-separator-->

    -  1.1a Submanifolds of \\[\mathbb{R}^N\\]

    <!--list-separator-->

    -  1.1b The geometry of Jacobian matrices: The "Differential"

    <!--list-separator-->

    -  1.1c The main theorem on submanifolds of \\[\mathbb{R}^N\\]

    <!--list-separator-->

    -  1.1d A nontrivial example: the configuration space of a rigid body

<!--list-separator-->

-  1.2 Manifolds

    <!--list-separator-->

    -  a. Some notions from point set topology

    <!--list-separator-->

    -  b. The idea of a manifold

    <!--list-separator-->

    -  c. A rigorous definition of a manifold

    <!--list-separator-->

    -  d. Complex manifolds: the Riemann sphere

<!--list-separator-->

-  1.3 Tangent vectors and mappings

    <!--list-separator-->

    -  a. Tangent or contravariant vectors

    <!--list-separator-->

    -  b. Vectors as differential operators

    <!--list-separator-->

    -  c. The tangent space to M^n at a point

    <!--list-separator-->

    -  d. Mappings and submanifolds of manifolds

    <!--list-separator-->

    -  e. Change of coordinates

<!--list-separator-->

-  1.4 Vector fields and flows

    <!--list-separator-->

    -  a. Vector fields and flows on \\[\mathbb{R}^n\\]

    <!--list-separator-->

    -  b. Vector fields on manifolds

    <!--list-separator-->

    -  c. Straightening flows


### 2. Tensors and exterior forms {#2-dot-tensors-and-exterior-forms}

<!--list-separator-->

-  2.1 Covectors and Riemannian metrics

<!--list-separator-->

-  2.2 The tangent bundle

<!--list-separator-->

-  2.3 The cotangent bundle and phase space

<!--list-separator-->

-  2.4 Tensors

<!--list-separator-->

-  2.5 The Grassmann or exterior algebra

<!--list-separator-->

-  2.6 Exterior differentiation

<!--list-separator-->

-  2.7 Pull-backs

<!--list-separator-->

-  2.8 Orientation and pseudoforms

<!--list-separator-->

-  2.9 Interior products and vector analysis

<!--list-separator-->

-  2.10 Dictionary


### 3. Integration of differential forms {#3-dot-integration-of-differential-forms}

<!--list-separator-->

-  3.1 Integration over a parametrized subset

<!--list-separator-->

-  3.2 Integration over manifolds with boundary

<!--list-separator-->

-  3.3 Stokes's theorem

<!--list-separator-->

-  3.4 Integration of pseudoforms

<!--list-separator-->

-  3.5 Maxwell's equations


### 4. The Lie derivative {#4-dot-the-lie-derivative}

<!--list-separator-->

-  4.1 The Lie derivative of a vector field

<!--list-separator-->

-  4.2 The Lie derivative of a form

<!--list-separator-->

-  4.3 Differentiation of integrals

<!--list-separator-->

-  4.4 A problem set on Hamiltonian mechanics


### 5. The Poincare lemma and potentials {#5-dot-the-poincare-lemma-and-potentials}

<!--list-separator-->

-  5.1 A more general Stokes's theorem

<!--list-separator-->

-  5.2 Closed forms and exact forms

<!--list-separator-->

-  5.3 Complex analysis

<!--list-separator-->

-  5.4 The converse to the Poincare lemma

<!--list-separator-->

-  5.5 Finding potentials


### 6. Holonomic and nonholonomic constraints {#6-dot-holonomic-and-nonholonomic-constraints}

<!--list-separator-->

-  6.1 The Frobenius integrability condition

<!--list-separator-->

-  6.2 Integrability and constraints

<!--list-separator-->

-  6.3 Heuristic thermodynamics via Caratheodory


## II. Geometry and topology {#ii-dot-geometry-and-topology}


### 7. \\[\mathbb{R}^3\\] and Minkowski space {#7-dot-mathbb-r-3-and-minkowski-space}

<!--list-separator-->

-  7.1 Curvature and special relativity

    <!--list-separator-->

    -  a. Curvature of a space curve in \\[\mathbb{R}^3\\]

    <!--list-separator-->

    -  b. Minkowski space and special relativity

    <!--list-separator-->

    -  c. Hamiltonian formulation

<!--list-separator-->

-  7.2 Electromagnetism in Minkowski space

    <!--list-separator-->

    -  a. Minkowski's electromagnetic field tensor

    <!--list-separator-->

    -  b. Maxwell's equations


### 8. The geometry of surfaces in \\[\mathbb{R}^3\\] {#8-dot-the-geometry-of-surfaces-in-mathbb-r-3}

<!--list-separator-->

-  8.1 The first and second fundamental forms

    <!--list-separator-->

    -  a. The first fundamental form, or metric tensor

    <!--list-separator-->

    -  b. The second fundamental form

<!--list-separator-->

-  8.2 Gaussian and mean curvatures

    <!--list-separator-->

    -  a. Symmetry and self-adjointness

    <!--list-separator-->

    -  b. Principal normal curvatures

    <!--list-separator-->

    -  c. Gauss and mean curvatures: the Gauss normal map

<!--list-separator-->

-  8.3 The Brouwer degree of a map: a problem set

    <!--list-separator-->

    -  a. The Brouwer degree

    <!--list-separator-->

    -  b. Complex analytic (Holomorphic) maps

    <!--list-separator-->

    -  c. The Gauss normal map revisited: the Gauss-Bonnet theorem

    <!--list-separator-->

    -  d. The Kronecker Index of a vector field

    <!--list-separator-->

    -  e. The Gauss looping integral

<!--list-separator-->

-  8.4 Area, mean curvature, and soap bubbles

    <!--list-separator-->

    -  a. The first variation of area

    <!--list-separator-->

    -  b. Soap bubbles and minimal surfaces

<!--list-separator-->

-  8.5 Gauss's theorema egregium

    <!--list-separator-->

    -  a. The equations of Gauss and Codazzi

    <!--list-separator-->

    -  b. The Theorema Egregium

<!--list-separator-->

-  8.6 Geodesics

    <!--list-separator-->

    -  a. The first variation of arc length

    <!--list-separator-->

    -  b. The intrinsic derivative and the geodesic equation

<!--list-separator-->

-  8.7 The parallel displacement of Levi-Civita


### 9. Covariant differentiation and curvature {#9-dot-covariant-differentiation-and-curvature}

<!--list-separator-->

-  9.1 Covariant differentiation

    <!--list-separator-->

    -  a. Covariant derivative

    <!--list-separator-->

    -  b. Curvature of an affine connection

    <!--list-separator-->

    -  c. Torsion and symmetry

<!--list-separator-->

-  9.2 The Riemmannian connection

<!--list-separator-->

-  9.3 Cartan's exterior covariant differential

    <!--list-separator-->

    -  a. Vector-valued forms

    <!--list-separator-->

    -  b. The Covariant differential of a vector field

    <!--list-separator-->

    -  c. Cartan's structural equations

    <!--list-separator-->

    -  d. The exterior covariant differential of a vector-valued form

    <!--list-separator-->

    -  e. The curvature 2-forms

<!--list-separator-->

-  9.4 Change of basis and gauge transformations

    <!--list-separator-->

    -  a. Symmetric connections only

    <!--list-separator-->

    -  b. Change of frame

<!--list-separator-->

-  9.5 The curvature forms in a Riemannian manifold

    <!--list-separator-->

    -  a. The Riemmannian connection

    <!--list-separator-->

    -  b. Riemannian surfaces \\[M^2\\]

<!--list-separator-->
