org/The_geometry_of_physics_by_Theodore_Frankel_in_2012.org
*** 9.6 Parallel displacement and curvature on a surface
*** 9.7 Riemann's theorem and the horizontal distribution
**** a. Flat metrics
**** b. The horizontal distribution of an affine connection
**** c. Riemann's theorem
** 10. Geodesics
*** 10.1 Geodesics and Jacobi fields
**** a. Vector fields along a surface in $$M^n$$
**** b. Geodesics
**** c. Jacobi fields
**** d. Energy
*** 10.2 Variational principles in mechanics
**** a. Hamilton's principle in the tangent bundle
**** b. Hamilton's principle in phase space
**** c. Jacobi's principle of least action
**** d. Closed geodesics and periodic motions
*** 10.3 Geodesics, spiders, and the universe
**** a. Gaussian coordinates
**** b. Normal coordinates on a surface
**** c. Spiders and the universe
** 11. Relativity, tensors, and curvature
*** 11.1 Heuristics of Einstein's theory
**** a. The metric potentials
**** b. Einstein's field equations
**** c. Remarks on static metrics
*** 11.2 Tensor analysis
**** a. Covariant differentiation of tensors
**** b. Riemannian connections and the Bianchi identities
**** c. Second covariant derivatives: the Ricci identities
*** 11.3 Hilbert's action principle
**** a. Geodesics in a pseudo-Riemannian manifold
**** b. Normal coordinates, the divergence and Laplacian
**** c. Hilbert's variational approach to general relativity
*** 11.4 The second fundamental form in the Riemannian case
**** a. The induced connection and the second fundamental form
**** b. The equations of Gauss and Codazzi
**** c. The interpretation of the sectional curvature
**** d. Fixed points of isometries
*** 11.5 The geometry of Einstein's equations
**** a. The Einstein tensor in a pseudo Riemannian space-time
**** b. The relativistic meaning of Gauss' equation
**** c. The second fundamental form of a spatial slice
**** d. The Codazzi equations
**** e. Some remarks on the Schwarzschild solution
** 12. Curvature and topology: Synge's theorem
*** 12.1 Synge's formula for second variation
**** a. The second variation of arc length
**** b. Jacobi fields
*** 12.2 Curvature and simple connectivity
**** a. Synge's theorem
**** b. Orientability revisited
** 13. Betti numbers and De Rham's theorem
*** 13.1 Singular chains and their boundaries
**** a. Singular chains
**** b. Some 2-dimensional examples
*** 13.2 The singular homology groups
**** a. Coefficient fields
**** b. Finite simplicial complexes
**** c. Cycles, boundaries, homology and Betti numbers
*** 13.3 Homology groups of familiar manifolds
**** a. Some computational tools
**** b. Familiar examples
*** 13.4 De Rham's theorem
**** a. The statement of de Rham's theorem
**** b. Two examples
** 14. Harmonic forms
*** 14.1 The Hodge operators
**** a. The * operator
**** b. The codifferential operator $$\delta = d^*$$
**** c. Maxwell's equations in curved space-time $$M^4$$
**** d. The Hilbert Lagrangian
*** 14.2 Harmonic forms
**** a. The Laplace operator on forms
**** b. The Laplacian of a 1-form
**** c. Harmonic forms on closed manifolds
**** d. Harmonic forms and de Rham's theorem
**** e. Bochner's theorem
*** 14.3 Boundary values, relative homology, and Morse theory
**** a. Tangential and normal differential forms
**** b. Hodge's theorem for tangential forms
**** c. Relative homology groups
**** d. Hodge's theorem for normal forms
**** e. Morse's theory of critical points
* III. Lie groups, bundles, and Chern forms
** 15. Lie groups
*** 15.1 Lie groups, invariant vector fields and forms
**** a. Lie groups
**** b. Invariant vector fields and forms
*** 15.2 One parameter subgroups
*** 15.3 The Lie algebra of a Lie group
**** a. The Lie algebra
**** b. The exponential map
**** c. Examples of Lie algebras
**** d. Do the 1-parameter subgroups cover G?
*** 15.4 Subgroups and subalgebras
**** a. Left invariant fields generate right translations
**** b. Commutators of matrices 
**** c. Right invariant fields
**** d. Subgroups and subalgebras
** 16. Vector bundles in geometry and physics
*** 16.1 Vector bundles
**** a. Motivation by two examples
**** b. Vector bundles
**** c. Local trivializations
**** d. The normal bundle to a submanifold
*** 16.2 Poincare's theorem and the Euler characteristic
**** a. Poincare's theorem
**** b. The Stiefel vector field and Euler's theorem
*** 16.3 Connections in a vector bundle
**** a. Connection in a vector bundle
**** b. Complex vector spaces
**** c. The structure group of a bundle
**** d. Complex line bundles
*** 16.4 The electromagnetic connection
**** a. Lagrange's equations without electromagnetism
**** b. The modified Lagrangian and Hamiltonian
**** c. Schrodinger's equation in an electromagnetic field
**** d. Global potentials
**** e. The Dirac monopole
**** f. The Aharonov-Bohm effect
** 17. [[file:fiber_bundle.org][fiber bundle]]s, Gauss-Bonnet, and topological quantization
*** 17.1 [[file:fiber_bundle.org][fiber bundle]]s and [[file:principal_bundle.org][principal bundle]]s
**** a. [[file:fiber_bundle.org][fiber bundle]]s
**** b. [[file:principal_bundle.org][principal bundle]]s and frame bundles
**** c. Action of the structure group on a [[file:principal_bundle.org][principal bundle]]
*** 17.2 Coset spaces
**** a. Cosets
**** b. Grassmann manifolds
*** 17.3 Chern's proof of the Gauss-Bonnet-Poincare theorem
**** a. A connection in the frame bundle of a surface
**** b. The Gauss-Bonnet-Poincare theorem
**** c. Gauss-Bonnet as an index theorem
*** 17.4 Line bundles, topological quantization and Berry phase
**** a. A generalization of Gauss-Bonnet
**** b. Berry phase
**** c. Monopoles and the Hopf bundle
** 18. Connections and associated bundles
*** 18.1 Forms with values in a Lie algebra
**** a. The Maurer-Cartan form
**** b. g-valued p-forms on a Manifold
**** c. Connections in a [[file:principal_bundle.org][principal bundle]]
*** 18.2 Associated bundles and connections
**** a. Associated bundles
