content/posts/The_geometry_of_physics_by_Theodore_Frankel_in_2012.md

-  9.6 Parallel displacement and curvature on a surface

<!--list-separator-->

-  9.7 Riemann's theorem and the horizontal distribution

    <!--list-separator-->

    -  a. Flat metrics

    <!--list-separator-->

    -  b. The horizontal distribution of an affine connection

    <!--list-separator-->

    -  c. Riemann's theorem


### 10. Geodesics {#10-dot-geodesics}

<!--list-separator-->

-  10.1 Geodesics and Jacobi fields

    <!--list-separator-->

    -  a. Vector fields along a surface in \\[M^n\\]

    <!--list-separator-->

    -  b. Geodesics

    <!--list-separator-->

    -  c. Jacobi fields

    <!--list-separator-->

    -  d. Energy

<!--list-separator-->

-  10.2 Variational principles in mechanics

    <!--list-separator-->

    -  a. Hamilton's principle in the tangent bundle

    <!--list-separator-->

    -  b. Hamilton's principle in phase space

    <!--list-separator-->

    -  c. Jacobi's principle of least action

    <!--list-separator-->

    -  d. Closed geodesics and periodic motions

<!--list-separator-->

-  10.3 Geodesics, spiders, and the universe

    <!--list-separator-->

    -  a. Gaussian coordinates

    <!--list-separator-->

    -  b. Normal coordinates on a surface

    <!--list-separator-->

    -  c. Spiders and the universe


### 11. Relativity, tensors, and curvature {#11-dot-relativity-tensors-and-curvature}

<!--list-separator-->

-  11.1 Heuristics of Einstein's theory

    <!--list-separator-->

    -  a. The metric potentials

    <!--list-separator-->

    -  b. Einstein's field equations

    <!--list-separator-->

    -  c. Remarks on static metrics

<!--list-separator-->

-  11.2 Tensor analysis

    <!--list-separator-->

    -  a. Covariant differentiation of tensors

    <!--list-separator-->

    -  b. Riemannian connections and the Bianchi identities

    <!--list-separator-->

    -  c. Second covariant derivatives: the Ricci identities

<!--list-separator-->

-  11.3 Hilbert's action principle

    <!--list-separator-->

    -  a. Geodesics in a pseudo-Riemannian manifold

    <!--list-separator-->

    -  b. Normal coordinates, the divergence and Laplacian

    <!--list-separator-->

    -  c. Hilbert's variational approach to general relativity

<!--list-separator-->

-  11.4 The second fundamental form in the Riemannian case

    <!--list-separator-->

    -  a. The induced connection and the second fundamental form

    <!--list-separator-->

    -  b. The equations of Gauss and Codazzi

    <!--list-separator-->

    -  c. The interpretation of the sectional curvature

    <!--list-separator-->

    -  d. Fixed points of isometries

<!--list-separator-->

-  11.5 The geometry of Einstein's equations

    <!--list-separator-->

    -  a. The Einstein tensor in a pseudo Riemannian space-time

    <!--list-separator-->

    -  b. The relativistic meaning of Gauss' equation

    <!--list-separator-->

    -  c. The second fundamental form of a spatial slice

    <!--list-separator-->

    -  d. The Codazzi equations

    <!--list-separator-->

    -  e. Some remarks on the Schwarzschild solution


### 12. Curvature and topology: Synge's theorem {#12-dot-curvature-and-topology-synge-s-theorem}

<!--list-separator-->

-  12.1 Synge's formula for second variation

    <!--list-separator-->

    -  a. The second variation of arc length

    <!--list-separator-->

    -  b. Jacobi fields

<!--list-separator-->

-  12.2 Curvature and simple connectivity

    <!--list-separator-->

    -  a. Synge's theorem

    <!--list-separator-->

    -  b. Orientability revisited


### 13. Betti numbers and De Rham's theorem {#13-dot-betti-numbers-and-de-rham-s-theorem}

<!--list-separator-->

-  13.1 Singular chains and their boundaries

    <!--list-separator-->

    -  a. Singular chains

    <!--list-separator-->

    -  b. Some 2-dimensional examples

<!--list-separator-->

-  13.2 The singular homology groups

    <!--list-separator-->

    -  a. Coefficient fields

    <!--list-separator-->

    -  b. Finite simplicial complexes

    <!--list-separator-->

    -  c. Cycles, boundaries, homology and Betti numbers

<!--list-separator-->

-  13.3 Homology groups of familiar manifolds

    <!--list-separator-->

    -  a. Some computational tools

    <!--list-separator-->

    -  b. Familiar examples

<!--list-separator-->

-  13.4 De Rham's theorem

    <!--list-separator-->

    -  a. The statement of de Rham's theorem

    <!--list-separator-->

    -  b. Two examples


### 14. Harmonic forms {#14-dot-harmonic-forms}

<!--list-separator-->

-  14.1 The Hodge operators

    <!--list-separator-->

    -  a. The \* operator

    <!--list-separator-->

    -  b. The codifferential operator \\[\delta = d^\*\\]

    <!--list-separator-->

    -  c. Maxwell's equations in curved space-time \\[M^4\\]

    <!--list-separator-->

    -  d. The Hilbert Lagrangian

<!--list-separator-->

-  14.2 Harmonic forms

    <!--list-separator-->

    -  a. The Laplace operator on forms

    <!--list-separator-->

    -  b. The Laplacian of a 1-form

    <!--list-separator-->

    -  c. Harmonic forms on closed manifolds

    <!--list-separator-->

    -  d. Harmonic forms and de Rham's theorem

    <!--list-separator-->

    -  e. Bochner's theorem

<!--list-separator-->

-  14.3 Boundary values, relative homology, and Morse theory

    <!--list-separator-->

    -  a. Tangential and normal differential forms

    <!--list-separator-->

    -  b. Hodge's theorem for tangential forms

    <!--list-separator-->

    -  c. Relative homology groups

    <!--list-separator-->

    -  d. Hodge's theorem for normal forms

    <!--list-separator-->

    -  e. Morse's theory of critical points


## III. Lie groups, bundles, and Chern forms {#iii-dot-lie-groups-bundles-and-chern-forms}


### 15. Lie groups {#15-dot-lie-groups}

<!--list-separator-->

-  15.1 Lie groups, invariant vector fields and forms

    <!--list-separator-->

    -  a. Lie groups

    <!--list-separator-->

    -  b. Invariant vector fields and forms

<!--list-separator-->

-  15.2 One parameter subgroups

<!--list-separator-->

-  15.3 The Lie algebra of a Lie group

    <!--list-separator-->

    -  a. The Lie algebra

    <!--list-separator-->

    -  b. The exponential map

    <!--list-separator-->

    -  c. Examples of Lie algebras

    <!--list-separator-->

    -  d. Do the 1-parameter subgroups cover G?

<!--list-separator-->

-  15.4 Subgroups and subalgebras

    <!--list-separator-->

    -  a. Left invariant fields generate right translations

    <!--list-separator-->

    -  b. Commutators of matrices

    <!--list-separator-->

    -  c. Right invariant fields

    <!--list-separator-->

    -  d. Subgroups and subalgebras


### 16. Vector bundles in geometry and physics {#16-dot-vector-bundles-in-geometry-and-physics}

<!--list-separator-->

-  16.1 Vector bundles

    <!--list-separator-->

    -  a. Motivation by two examples

    <!--list-separator-->

    -  b. Vector bundles

    <!--list-separator-->

    -  c. Local trivializations

    <!--list-separator-->

    -  d. The normal bundle to a submanifold

<!--list-separator-->

-  16.2 Poincare's theorem and the Euler characteristic

    <!--list-separator-->

    -  a. Poincare's theorem

    <!--list-separator-->

    -  b. The Stiefel vector field and Euler's theorem

<!--list-separator-->

-  16.3 Connections in a vector bundle

    <!--list-separator-->

    -  a. Connection in a vector bundle

    <!--list-separator-->

    -  b. Complex vector spaces

    <!--list-separator-->

    -  c. The structure group of a bundle

    <!--list-separator-->

    -  d. Complex line bundles

<!--list-separator-->

-  16.4 The electromagnetic connection

    <!--list-separator-->

    -  a. Lagrange's equations without electromagnetism

    <!--list-separator-->

    -  b. The modified Lagrangian and Hamiltonian

    <!--list-separator-->

    -  c. Schrodinger's equation in an electromagnetic field

    <!--list-separator-->

    -  d. Global potentials

    <!--list-separator-->

    -  e. The Dirac monopole

    <!--list-separator-->

    -  f. The Aharonov-Bohm effect


### 17. [fiber bundle]({{< relref "fiber_bundle" >}})s, Gauss-Bonnet, and topological quantization {#17-dot-fiber-bundle--fiber-bundle-dot-md--s-gauss-bonnet-and-topological-quantization}

<!--list-separator-->

-  17.1 [fiber bundle]({{< relref "fiber_bundle" >}})s and [principal bundle]({{< relref "principal_bundle" >}})s

    <!--list-separator-->

    -  a. [fiber bundle]({{< relref "fiber_bundle" >}})s

    <!--list-separator-->

    -  b. [principal bundle]({{< relref "principal_bundle" >}})s and frame bundles

    <!--list-separator-->

    -  c. Action of the structure group on a [principal bundle]({{< relref "principal_bundle" >}})

<!--list-separator-->

-  17.2 Coset spaces

    <!--list-separator-->

    -  a. Cosets

    <!--list-separator-->

    -  b. Grassmann manifolds

<!--list-separator-->

-  17.3 Chern's proof of the Gauss-Bonnet-Poincare theorem

    <!--list-separator-->

    -  a. A connection in the frame bundle of a surface

    <!--list-separator-->

    -  b. The Gauss-Bonnet-Poincare theorem

    <!--list-separator-->

    -  c. Gauss-Bonnet as an index theorem

<!--list-separator-->

-  17.4 Line bundles, topological quantization and Berry phase

    <!--list-separator-->

    -  a. A generalization of Gauss-Bonnet

    <!--list-separator-->

    -  b. Berry phase

    <!--list-separator-->

    -  c. Monopoles and the Hopf bundle


### 18. Connections and associated bundles {#18-dot-connections-and-associated-bundles}

<!--list-separator-->

-  18.1 Forms with values in a Lie algebra

    <!--list-separator-->

    -  a. The Maurer-Cartan form

    <!--list-separator-->

    -  b. g-valued p-forms on a Manifold

    <!--list-separator-->

    -  c. Connections in a [principal bundle]({{< relref "principal_bundle" >}})

<!--list-separator-->

-  18.2 Associated bundles and connections

    <!--list-separator-->

    -  a. Associated bundles

    <!--list-separator-->
