org/The_geometry_of_physics_by_Theodore_Frankel_in_2012.org
**** b. Connections in associated bundles
**** c. The associated $$Ad$$ bundle
*** 18.3 r-Form sections of a vector bundle: curvature
**** a. r-Form sections of E
**** b. Curvature and the $$Ad$$ bundle
** 19. The Dirac equation
*** 19.1 The groups $$SO(3)$$ and $$SU(2)$$
**** a. The rotation group $$SO(3)$$ of $$\mathbb{R}^3$$
**** b. $$SU(2)$$: the Lie algebra $$su(2)$$
**** c. $$SU(2)$$ is topologically the 3-sphere
**** d. $$Ad \colon SU(2) \rightarrow SO(3)$$ in more detail
*** 19.2 Hamilton, Clifford, and Dirac
**** a. [[file:spinors.org][spinors]] and rotations of $$\mathbb{R}^3$$
**** b. Hamilton on composing two rotations
**** c. Clifford algebras
**** d. The Dirac program: the square root of the d'Alembertian
*** 19.3 The Dirac algebra
**** a. The Lorentz algebra
**** b. The Dirac algebra
*** 19.4 The Dirac operator $$\partial$$ in Minkowski space
**** a. Dirac [[file:spinors.org][spinors]]
**** b. The Dirac operator
*** 19.5 The Dirac operator in curved space-time
**** a. The spinor bundle
**** b. The spin connection in SM
** 20. Yang-Mills fields
*** 20.1 Noether's theorem for internal symmetries
**** a. The tensorial nature of Lagrange's equations
**** b. Boundary conditions
**** c. Noether's theorem for internal symmetries
**** d. Noether's principle 
*** 20.2 Weyl's gauge invariance revisited
**** a. The Dirac Lagrangian
**** b. Weyl's Gauge invariance revisited
**** c. The electromagnetic Lagrangian
**** d. Quantization of the A field: photons
*** 20.3 Yang-Mills nucleon
**** a. The Heisenberg nucleon
**** b. The Yang-Mills nucleon
**** c. A remark on terminology
*** 20.4 Compact groups and Yang-Mills action
**** a. The unitary group is compact
**** b. Averaging over a compact group
**** c. Compact matrix groups are subgroups of unitary groups
**** d. $$Ad$$ invariant scalar products in the Lie algebra of a compact group
**** e. The Yang-Mills action
*** 20.5 The Yang-Mills equation
**** a. The exterior covariant divergence $$\Delta^*$$
**** b. The Yang-Mills analogy with electromagnetism
**** c. Further remarks on the Yang-Mills equations
*** 20.6 Yang-Mills instantons
**** a. Instantons
**** b. Chern's proof revisited
**** c. Instantons and the vacuum
** 21. Betti numbers and covering spaces
*** 21.1 Bi-invariant forms on compact groups
**** a. Bi-invariant p-forms
**** b. The Cartan p-forms
**** c. Bi-invariant Riemannian metrics
**** d. Harmonic forms in the bi-invariant metric
**** e. Weyl and Cartan on the Betti numbers of G
*** 21.2 The fundamental group and covering spaces
**** a. Poincare's fundamental group $$\pi_1(M)$$
**** b. The concept of a covering space
**** c. The universal covering 
**** d. The orientable covering 
**** e. Lifting paths
**** f. Subgroups of $$\pi(M)$$
**** g. The universal covering group
*** 21.3 The theoreme of S.B. Myers: A problem set
*** 21.4 The geometry of a Lie group
**** a. The connection of a bi-invariant metric
**** b. The flat connections
** 22. Chern forms and homotopy groups
*** 22.1 Chern forms and winding numbers
**** a. The Yang-Mills winding number
**** b. Winding number in terms of field strength
**** c. The Chern forms for a $$U(n)$$ bundle
*** 22.2 Homotopies and extensions
**** a. Homotopy
**** b. Covering homotopy
**** c. Some topology of $$SU(n)$$
*** 22.3 The higher homotopy groups $$\pi_k(M)$$
**** a. $$\pi_k (M)$$
**** b. Homotopy groups of spheres
**** c. Exact sequences of groups
**** d. The homotopy sequence of a bundle
**** e. The relation between homotopy and homology groups
*** 22.4 Some computations of homotopy groups
**** a. Lifting spheres from $$M$$ into the bundle $$P$$
**** b. $$SU(n)$$ again
**** c. The Hopf map and fibering
*** 22.5 Chern forms as obstructions
**** a. The Chern forms $$c_r$$ for an $$SU(n)$$ bundle revisited
**** b. $$c_2$$ as an obstruction cocycle
**** c. The meaning of the integer $$j(\Delta_4)$$
**** d. Chern's integral
**** e. Concluding remarks
* Appendices
** A. Forms in continuum mechanics
*** a The equations of motion of a stressed body
*** b. Stresses are vector valued $$(n-1)$$ pseudo-forms
*** c. The Piola-Kirchoff stress tensors $$S$$ and $$P$$
*** d. Strain energy rate
*** e. Some typical computations using forms
*** f. Concluding remarks
** B. Harmonic chains and Kirchhoff's circuit laws
*** a. Chain complexes
*** b. Cochains and cohomology
*** c. Transpose and adjoint
*** d. Laplacians and harmonic cochains
*** e. Kirchoff's circuit laws
** C. Symmetries, quarks, and meson masses
*** a. Flavored quarks
*** b. Interactions of quarks and antiquarks
*** c. The Lie algebra of $$SU(3)$$
*** d. Pions, kaons, and etas
*** e. A reduced symmetry group
*** f. Meson masses
** D. Representations and hyperelastic bodies
*** a. Hyperelastic bodies
*** b. Isotropic bodies
*** c. Application of Schur's lemma
*** d. Frobenius-Schur relations
*** e. The symmeteric traceless $$3 \times 3$$ matrices are irreducible
** E. Orbits and Morse-Bott theory in compact Lie groups
*** a. The topology of conjugacy orbits
*** b. Application of Bott's extension of Morse theory
