content/posts/The_geometry_of_physics_by_Theodore_Frankel_in_2012.md

    -  b. Connections in associated bundles

    <!--list-separator-->

    -  c. The associated \\[Ad\\] bundle

<!--list-separator-->

-  18.3 r-Form sections of a vector bundle: curvature

    <!--list-separator-->

    -  a. r-Form sections of E

    <!--list-separator-->

    -  b. Curvature and the \\[Ad\\] bundle


### 19. The Dirac equation {#19-dot-the-dirac-equation}

<!--list-separator-->

-  19.1 The groups \\[SO(3)\\] and \\[SU(2)\\]

    <!--list-separator-->

    -  a. The rotation group \\[SO(3)\\] of \\[\mathbb{R}^3\\]

    <!--list-separator-->

    -  b. \\[SU(2)\\]: the Lie algebra \\[su(2)\\]

    <!--list-separator-->

    -  c. \\[SU(2)\\] is topologically the 3-sphere

    <!--list-separator-->

    -  d. \\[Ad \colon SU(2) \rightarrow SO(3)\\] in more detail

<!--list-separator-->

-  19.2 Hamilton, Clifford, and Dirac

    <!--list-separator-->

    -  a. [spinors]({{< relref "spinors" >}}) and rotations of \\[\mathbb{R}^3\\]

    <!--list-separator-->

    -  b. Hamilton on composing two rotations

    <!--list-separator-->

    -  c. Clifford algebras

    <!--list-separator-->

    -  d. The Dirac program: the square root of the d'Alembertian

<!--list-separator-->

-  19.3 The Dirac algebra

    <!--list-separator-->

    -  a. The Lorentz algebra

    <!--list-separator-->

    -  b. The Dirac algebra

<!--list-separator-->

-  19.4 The Dirac operator \\[\partial\\] in Minkowski space

    <!--list-separator-->

    -  a. Dirac [spinors]({{< relref "spinors" >}})

    <!--list-separator-->

    -  b. The Dirac operator

<!--list-separator-->

-  19.5 The Dirac operator in curved space-time

    <!--list-separator-->

    -  a. The spinor bundle

    <!--list-separator-->

    -  b. The spin connection in SM


### 20. Yang-Mills fields {#20-dot-yang-mills-fields}

<!--list-separator-->

-  20.1 Noether's theorem for internal symmetries

    <!--list-separator-->

    -  a. The tensorial nature of Lagrange's equations

    <!--list-separator-->

    -  b. Boundary conditions

    <!--list-separator-->

    -  c. Noether's theorem for internal symmetries

    <!--list-separator-->

    -  d. Noether's principle

<!--list-separator-->

-  20.2 Weyl's gauge invariance revisited

    <!--list-separator-->

    -  a. The Dirac Lagrangian

    <!--list-separator-->

    -  b. Weyl's Gauge invariance revisited

    <!--list-separator-->

    -  c. The electromagnetic Lagrangian

    <!--list-separator-->

    -  d. Quantization of the A field: photons

<!--list-separator-->

-  20.3 Yang-Mills nucleon

    <!--list-separator-->

    -  a. The Heisenberg nucleon

    <!--list-separator-->

    -  b. The Yang-Mills nucleon

    <!--list-separator-->

    -  c. A remark on terminology

<!--list-separator-->

-  20.4 Compact groups and Yang-Mills action

    <!--list-separator-->

    -  a. The unitary group is compact

    <!--list-separator-->

    -  b. Averaging over a compact group

    <!--list-separator-->

    -  c. Compact matrix groups are subgroups of unitary groups

    <!--list-separator-->

    -  d. \\[Ad\\] invariant scalar products in the Lie algebra of a compact group

    <!--list-separator-->

    -  e. The Yang-Mills action

<!--list-separator-->

-  20.5 The Yang-Mills equation

    <!--list-separator-->

    -  a. The exterior covariant divergence \\[\Delta^\*\\]

    <!--list-separator-->

    -  b. The Yang-Mills analogy with electromagnetism

    <!--list-separator-->

    -  c. Further remarks on the Yang-Mills equations

<!--list-separator-->

-  20.6 Yang-Mills instantons

    <!--list-separator-->

    -  a. Instantons

    <!--list-separator-->

    -  b. Chern's proof revisited

    <!--list-separator-->

    -  c. Instantons and the vacuum


### 21. Betti numbers and covering spaces {#21-dot-betti-numbers-and-covering-spaces}

<!--list-separator-->

-  21.1 Bi-invariant forms on compact groups

    <!--list-separator-->

    -  a. Bi-invariant p-forms

    <!--list-separator-->

    -  b. The Cartan p-forms

    <!--list-separator-->

    -  c. Bi-invariant Riemannian metrics

    <!--list-separator-->

    -  d. Harmonic forms in the bi-invariant metric

    <!--list-separator-->

    -  e. Weyl and Cartan on the Betti numbers of G

<!--list-separator-->

-  21.2 The fundamental group and covering spaces

    <!--list-separator-->

    -  a. Poincare's fundamental group \\[\pi\_1(M)\\]

    <!--list-separator-->

    -  b. The concept of a covering space

    <!--list-separator-->

    -  c. The universal covering

    <!--list-separator-->

    -  d. The orientable covering

    <!--list-separator-->

    -  e. Lifting paths

    <!--list-separator-->

    -  f. Subgroups of \\[\pi(M)\\]

    <!--list-separator-->

    -  g. The universal covering group

<!--list-separator-->

-  21.3 The theoreme of S.B. Myers: A problem set

<!--list-separator-->

-  21.4 The geometry of a Lie group

    <!--list-separator-->

    -  a. The connection of a bi-invariant metric

    <!--list-separator-->

    -  b. The flat connections


### 22. Chern forms and homotopy groups {#22-dot-chern-forms-and-homotopy-groups}

<!--list-separator-->

-  22.1 Chern forms and winding numbers

    <!--list-separator-->

    -  a. The Yang-Mills winding number

    <!--list-separator-->

    -  b. Winding number in terms of field strength

    <!--list-separator-->

    -  c. The Chern forms for a \\[U(n)\\] bundle

<!--list-separator-->

-  22.2 Homotopies and extensions

    <!--list-separator-->

    -  a. Homotopy

    <!--list-separator-->

    -  b. Covering homotopy

    <!--list-separator-->

    -  c. Some topology of \\[SU(n)\\]

<!--list-separator-->

-  22.3 The higher homotopy groups \\[\pi\_k(M)\\]

    <!--list-separator-->

    -  a. \\[\pi\_k (M)\\]

    <!--list-separator-->

    -  b. Homotopy groups of spheres

    <!--list-separator-->

    -  c. Exact sequences of groups

    <!--list-separator-->

    -  d. The homotopy sequence of a bundle

    <!--list-separator-->

    -  e. The relation between homotopy and homology groups

<!--list-separator-->

-  22.4 Some computations of homotopy groups

    <!--list-separator-->

    -  a. Lifting spheres from \\[M\\] into the bundle \\[P\\]

    <!--list-separator-->

    -  b. \\[SU(n)\\] again

    <!--list-separator-->

    -  c. The Hopf map and fibering

<!--list-separator-->

-  22.5 Chern forms as obstructions

    <!--list-separator-->

    -  a. The Chern forms \\[c\_r\\] for an \\[SU(n)\\] bundle revisited

    <!--list-separator-->

    -  b. \\[c\_2\\] as an obstruction cocycle

    <!--list-separator-->

    -  c. The meaning of the integer \\[j(\Delta\_4)\\]

    <!--list-separator-->

    -  d. Chern's integral

    <!--list-separator-->

    -  e. Concluding remarks


## Appendices {#appendices}


### A. Forms in continuum mechanics {#a-dot-forms-in-continuum-mechanics}

<!--list-separator-->

-  a The equations of motion of a stressed body

<!--list-separator-->

-  b. Stresses are vector valued \\[(n-1)\\] pseudo-forms

<!--list-separator-->

-  c. The Piola-Kirchoff stress tensors \\[S\\] and \\[P\\]

<!--list-separator-->

-  d. Strain energy rate

<!--list-separator-->

-  e. Some typical computations using forms

<!--list-separator-->

-  f. Concluding remarks


### B. Harmonic chains and Kirchhoff's circuit laws {#b-dot-harmonic-chains-and-kirchhoff-s-circuit-laws}

<!--list-separator-->

-  a. Chain complexes

<!--list-separator-->

-  b. Cochains and cohomology

<!--list-separator-->

-  c. Transpose and adjoint

<!--list-separator-->

-  d. Laplacians and harmonic cochains

<!--list-separator-->

-  e. Kirchoff's circuit laws


### C. Symmetries, quarks, and meson masses {#c-dot-symmetries-quarks-and-meson-masses}

<!--list-separator-->

-  a. Flavored quarks

<!--list-separator-->

-  b. Interactions of quarks and antiquarks

<!--list-separator-->

-  c. The Lie algebra of \\[SU(3)\\]

<!--list-separator-->

-  d. Pions, kaons, and etas

<!--list-separator-->

-  e. A reduced symmetry group

<!--list-separator-->

-  f. Meson masses


### D. Representations and hyperelastic bodies {#d-dot-representations-and-hyperelastic-bodies}

<!--list-separator-->

-  a. Hyperelastic bodies

<!--list-separator-->

-  b. Isotropic bodies

<!--list-separator-->

-  c. Application of Schur's lemma

<!--list-separator-->

-  d. Frobenius-Schur relations

<!--list-separator-->

-  e. The symmeteric traceless \\[3 \times 3\\] matrices are irreducible


### E. Orbits and Morse-Bott theory in compact Lie groups {#e-dot-orbits-and-morse-bott-theory-in-compact-lie-groups}

<!--list-separator-->

-  a. The topology of conjugacy orbits

<!--list-separator-->

-  b. Application of Bott's extension of Morse theory
